pkg load control
clear();

m = 0.2;
l = 0.3;
M = 0.3;
g = 9.8;
J = 1/12*m*l^2;

a = (M+m)*(m*l^2+J)-m^2*l^2;
A = [0, 0, 1, 0; 0, 0, 0, 1; 0, -m^2*l^2*g/a, 0, 0; 0, (m+M)*m*l*g/a, 0, 0];
B = [0, 0, (m*l^2+J)/a, -m*l/a]';
C = [1, 0, 0, 1];

%可制御性・可観測性の判定-----------------------------------------------------------
Uc = [B, A*B, A*A*B, A*A*A*B];
Uo = [C ; C*A ; C*A*A ; C*A*A*A];
kaseigyo = det(Uc);
kakannsoku = det(Uo);

if kaseigyo != 0
  disp("可制御である");
else
  disp("可制御でない");
endif

if kakannsoku != 0
  disp("可観測である");
else
  disp("可観測でない");
endif
%-------------------------------------------------------------------------------

%状態観測器のLを求める----------------------------------------------------------
Aa = A';
Ba = C';
Ca = B';
D = 0;

sysT= ss(Aa, Ba, Ca, D);
P = [-1, -2, -3, -4]; %適当な値
L = place(sysT, P)';
%-------------------------------------------------------------------------------

%最適制御の状態フィードバックゲインFを求める------------------------------------
Q = [1, 0, 0, 0 ; 0, 1, 0, 0 ; 0, 0, 1, 0 ; 0, 0, 0, 1]; %適当な値
R = 1; %適当な値
F = lqr(A, B, Q, R);
%-------------------------------------------------------------------------------

x = [0.1; 0.1; 0.1; 0.1];
xh = [0; 0; 0; 0];

xb = [x; xh];
Ab =  [A, -B*F; L*C, A - B*F - L*C]; %併合系

dt = 0.01;
t = 0: dt: 10;
i = 0;

for n = t
    i = i + 1;
    xb = xb + Ab * xb * dt; %状態遷移行列を用いて算出
    x1(i) = xb(1);
    x2(i) = xb(2);
    x3(i) = xb(3);
    x4(i) = xb(4);
    xh1(i) = xb(5);
    xh2(i) = xb(6);
    xh3(i) = xb(7);
    xh4(i) = xb(8);
endfor

plot(t, x1, t, x2, t, x3, t, x4, t, xh1, 'o', t, xh2, 'o', t, xh3, 'o', t, xh4, 'o');